[
  "An escalator can never break: it can only become stairs.",
  "You should never see an Escalator Temporarily Out Of Order sign, just Escalator Temporarily Stairs. Sorry for the convenience.",
  "I don't have a girlfriend. But I do know a woman who'd be mad at me for saying that.",
  "I like refried beans. That's why I wanna try fried beans, because maybe they're just as good and we're just wasting time. You don't have to fry them again after all.",
  "I'm against picketing, but I don't know how to show it.",
  "Rice is great if you're really hungry and want to eat two thousand of something.",
  "My friend asked me if I wanted a frozen banana. I said 'No, but I want a regular banana later, so... yeah.'",
  "Is a hippopotamus a hippopotamus, or just a really cool Opotamus?",
  "The depressing thing about tennis is that no matter how good I get, I'll never be as good as a wall.",
  "I haven't slept for ten days, because that would be too long.",
  "I wanted to buy a candle holder, but the store didn't have one. So I got a cake.",
  "I bought a seven-dollar pen because I always lose pens and I got sick of not caring.",
  "I know a lot about cars, man. I can look at any car's headlights and tell you exactly which way it's coming.",
  "This shirt is dry clean only. Which means... it's dirty.",
  "When someone hands you a flyer, it's like they're saying here you throw this away.",
  "A waffle is like a pancake with a syrup trap.",
  "I wear a necklace, cause I wanna know when I'm upside down.",
  "Dogs are forever in the push up postion.",
  "If my kid couldn't draw I'd make sure that my kitchen magnets didn't work.",
  "I like Kit-Kat, unless I'm with four or more people.",
  "I like to play blackjack. I'm not addicted to gambling. I'm addicted to sitting in a semi-circle.",
  "Every time I go and shave, I assume there's someone else on the planet shaving. So I say, 'I'm gonna go shave, too.'",
  "A severed foot is the ultimate stocking stuffer.",
  "I'm gonna fix that last joke by taking out all the words and adding new ones.",
  "If I had nine of my fingers missing I wouldn't type any slower.",
  "Why is Cloud 9 so amazing? What is wrong with Cloud 8? That joke came off the top of my head, and the top of my head ain't funny!",
  "I'm sick of following my dreams. I'm just going to ask them where they're goin', and hook up with them later.",
  "My fake plants died because I did not pretend to water them.",
  "My belt holds my pants up, but the belt loops hold my belt up. I don't really know what's happening down there. Who is the real hero?",
  "You know when they have a fishing show on TV? They catch the fish and then let it go. They don't want to eat the fish, they just want to make it late for something.",
  "Every book is a children's book if the kid can read.",
  "I want to get a vending machine, with fun sized candy bars, and the glass in front is a magnifying glass. You'll be mad, but it will be too late.",
  "I remixed a remix, it was back to normal.",
  "I once saw a forklift lift a crate of forks. And it was way to literal for me.",
  "I think foosball is a combination of soccer and shish kabobs.",
  "It's very dangerous to wave to people you don't know because what if they don't have hands? They'll think you're cocky.",
  "I recently took up ice sculpting. Last night I made an ice cube. This morning I made 12, I was prolific.",
  "People teach their dogs to sit; it's a trick. I've been sitting my whole life, and a dog has never looked at me as though he thought I was tricky.",
  "Bologna is a deli meat for people with eyes.",
  "I'd like to get four people who do cart wheels very good, and make a cart.",
  "All these jokes have been pre-approved as funny by me.",
  "I can whistle with my fingers, especially if I have a whistle."
]
